# Relatório de Análise 5

### Importando dados

In [18]:
import pandas as pd

In [19]:
candidatos_vereador = pd.read_csv('dados/candidatos_vereador.csv', sep = ';', encoding = 'latin-1', header = None)
candidatos_vereador.head()

                 0      1
0           ABAJUR  31013
1           ABDIAS  54186
2   ABEL FERNANDEZ  10111
3        ABOU ANNI  43010
4  ABRAAO DO QUEJO  12136

In [20]:
secoes = pd.read_csv('dados/secoes.csv', sep = ';', encoding = 'latin-1', header = None)
secoes.head()

   0  1
0  1  1
1  1  2
2  1  3
3  1  4
4  1  5

In [21]:
zonas = pd.read_csv('dados/zonas.csv', sep = ';', encoding = 'latin-1', header = None)
zonas.head()

   0
0  1
1  2
2  3
3  4
4  5

In [22]:
freq_secao = pd.read_csv('dados/freq_secao.csv', sep = ';', encoding = 'latin-1', header = None)
freq_secao.head()

       0      1
0  43666  21551
1  45190  20693
2  11333  18834
3  40096  18281
4  65000  18107

In [23]:
freq_zona = pd.read_csv('dados/freq_zona.csv', sep = ';', encoding = 'latin-1', header = None)
freq_zona.head()

       0   1
0  13130  58
1  50077  58
2  22122  58
3  13100  58
4  13112  58

### Número de Seções e de Zonas, respectivamente

In [24]:
secoes.shape[0]

23684

In [25]:
zonas.shape[0]

58

### Candidatos que não receberam votos em todas as seções

In [26]:
selection = (freq_secao[1] != secoes.shape[0])
cand_ntodas_secoes = freq_secao[selection]
cand_ntodas_secoes.head()

       0      1
0  43666  21551
1  45190  20693
2  11333  18834
3  40096  18281
4  65000  18107

In [27]:
cand_ntodas_secoes.shape

(1166, 2)

In [28]:
cand_ntodas_secoes.rename(columns = {0: 'NumeroUrna', 1: 'QtdSecoesVotado'}, inplace = True)
candidatos_vereador.rename(columns = {0: 'NomeCandidato', 1: 'NumeroUrna'}, inplace = True)
resultado_secoes = pd.merge(candidatos_vereador, cand_ntodas_secoes, on = 'NumeroUrna')
resultado_secoes.head()

     NomeCandidato  NumeroUrna  QtdSecoesVotado
0           ABAJUR       31013              208
1           ABDIAS       54186               97
2   ABEL FERNANDEZ       10111             1734
3        ABOU ANNI       43010            11760
4  ABRAAO DO QUEJO       12136              415

In [29]:
resultado_secoes.shape

(1144, 3)

### Candidatos que não receberam votos em todas as zonas

In [30]:
selection = (freq_zona[1] != zonas.shape[0])
cand_ntodas_zonas = freq_zona[selection]
cand_ntodas_zonas.head()

         0   1
276  65544  57
277  54654  57
278  15011  57
279  13137  57
280  50505  57

In [31]:
cand_ntodas_zonas.shape

(890, 2)

In [32]:
cand_ntodas_zonas.rename(columns = {0: 'NumeroUrna', 1: 'QtdZonasVotado'}, inplace = True)
candidatos_vereador.rename(columns = {0: 'NomeCandidato', 1: 'NumeroUrna'}, inplace = True)
resultado_zonas = pd.merge(candidatos_vereador, cand_ntodas_zonas, on = 'NumeroUrna')
resultado_zonas.head()

      NomeCandidato  NumeroUrna  QtdZonasVotado
0            ABAJUR       31013              48
1            ABDIAS       54186              22
2   ABRAAO DO QUEJO       12136              48
3  ADAILTON BARRETO       20338              23
4  ADALBERTO VIEIRA       13570              55

In [33]:
resultado_zonas.shape

(870, 3)

### Exportando Resultados

In [34]:
resultado_secoes.to_csv('dados/resultado_secoes.csv', sep = ';', index = False, encoding = 'latin-1')
resultado_zonas.to_csv('dados/resultado_zonas.csv', sep = ';', index = False, encoding = 'latin-1')